def z1():
    coun = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                 "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(coun)
    print(coun['Сербия'])
    for key in sorted(coun):
        print( key," - ", coun[key] )

z1()

def z2():
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }
    w = input('слово: ' )
    s = 0
    for i in w:
        s +=alph[i.lower()]
    print('сумма: ', s)

z2()

def z3():
    a = { "иванов":["китайский", "английский", "русский"],
          "сидоров" : ["русский", "французский"],
          "фролов": ["финский", "русский", "китайский"],
          "маслов": ["русский"],
          "федоров" : ["китайский","русский"]}
    c = ["китайский", "английский", "русский", "финский", "французский"]
    print(sorted(c))
    for key, value in a.items():
        if "китайский" in value:
            print(key)
z3()